<?php


return [

    /*
    |--------------------------------------------------------------------------
    | Pagination Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the paginator library to build
    | the simple pagination links. You are free to change them to anything
    | you want to customize your views to better match your application.
    |
    */

    'NO_ERROR' => 'عملية ناجحة',
    'ERROR_100' => 'المستخدم غير مسجل الدخول.',
    'ERROR_101' => 'المستخدم ليس لديه الصلاحيات الصحيحة.',
    'ERROR_102' => 'اسم المستخدم أو كلمة المرور غير صحيحة.',
    'ERROR_103' => 'عنوان بريد الكتروني المستخدم غير موثق.',
    'ERROR_104' => 'رقم هاتف المستخدم غير موثق.',
    'ERROR_105' => 'حساب المستخدم غير موثق.',
    'ERROR_106' => 'المستخدم موجود بالفعل.',
    'ERROR_107' => 'الرجاء تسجيل الدخول باستخدام فيسبوك أو جوجل.',
    'ERROR_108' => 'المستخدم لا يمتلك محفظة.',
    'ERROR_109' => 'رصيد المحفظة غير كافٍ.',
    'ERROR_110' => 'لا يمكن تحديث دور هذا المستخدم.',

    'ERROR_201' => 'رمز OTP غير صحيح',
    'ERROR_202' => 'الكثير من الطلبات، يرجى المحاولة لاحقًا',
    'ERROR_203' => 'انتهت صلاحية رمز OTP',

    'ERROR_204' => 'أنت لست بائعًا بعد أو لم يتم إنشاء متجرك بعد',
    'ERROR_205' => 'المتجر تم إنشاؤه بالفعل',
    'ERROR_206' => 'المستخدم لديه بالفعل متجر',
    'ERROR_207' => 'لا يمكن تحديث بائع المتجر',
    'ERROR_208' => 'الاشتراك مفعل بالفعل',

    'ERROR_249' => 'كوبون غير صالح',
    'ERROR_250' => 'انتهت صلاحية الكوبون',
    'ERROR_251' => 'تم استخدام الكوبون بالفعل',
    'ERROR_252' => 'الحالة تم استخدامها بالفعل',
    'ERROR_253' => 'نوع الحالة خاطئ',
    'ERROR_254' => 'لا يمكن تحديث حالة الإلغاء',
    'ERROR_255' => 'لا يمكنك إلغاء الحجز',
    'ERROR_256' => 'عذرًا، بعض المنتجات غير متوفرة في الوقت الحالي. تم طلبها من قبل عملاء آخرين، يرجى التحقق من عربة التسوق الخاصة بك',

    'ERROR_400' => 'طلب سيء.',
    'ERROR_403' => 'مشروعك غير مفعل.',
    'ERROR_404' => 'العناصر غير موجودة.',
    'ERROR_413' => 'نوع غير معروف',
    'ERROR_415' => 'لا يوجد اتصال بقاعدة البيانات',
    'ERROR_429' => 'الكثير من الطلبات',

    'ERROR_501' => 'خطأ أثناء الإنشاء',
    'ERROR_502' => 'خطأ أثناء التحديث',
    'ERROR_503' => 'خطأ أثناء الحذف.',
    'ERROR_504' => 'لا يمكن حذف السجل الذي يحتوي على قيم.',
    'ERROR_505' => 'لا يمكن حذف السجل الافتراضي.',
    'ERROR_506' => 'موجود بالفعل.',
    'ERROR_507' => 'لا يمكن حذف السجل الذي يحتوي على منتجات.',

];
